[{"id":1,"Province":"British Columbia","LongLat":"(-79.6089, 43.8084)","City":"Surrey Upper West","Affected_Service_llama":"Internet","Concern_llama":"Service Quality","carrier":"TelcoA","title":"Internet service quality issues for customers in Surrey Upper West, British Colombia","regional_title":"Internet service quality issues for customers in Surrey Upper West, British Colombia","count":11,"count_adj":32,"relative":"High","tweets":"[\"Yuuuup.\\nSome nearby\/ neighbours have had mix results with some of those options, but they get more and more appealing everytime this happens.\", \"@TelcoA_Support I have had no internet since Monday and talked to many of your people and your technicians have missed appointments to come and repair on Tues, Wed and now Thursday and now they say they can come next Tuesday. I guess you really don\\u2019t care about your customers.\", \"@TelcoA_Support any reason why mine and everyone else I know using TelcoA internet randomly disconnects for 30 seconds then comes back like nothing happened?\", \"Same issue here their service is garbage\", \"Weirdly was having the same issue. I turned wifi off on my phone and it works fine on LTE. Turned wifi back on and it\\u2019s back to normal for about a minute and then drops again \\ud83e\\udd37\\u200d\\u2642\\ufe0f\", \"Marking them as spam is not helping....have been doing that for years.  The last week has shown a drastic increase in spam volume for not only me, but a friend and someone on the message board you referred me to.  Something is up...please investigate and look into a better solve\"]","secone_data":"Over the past 6 hours in Surrey Upper West, British Colombia, call and video quality jitter scores have been above desired threshold (>30ms) 29% of the time.\n- Average Call Performance Jitter Score: 32ms\n- Average Video Performance Jitter Score: 29ms"},{"id":2,"Province":"Ontario","LongLat":"(-77.386, 44.0594)","City":"Quinte Shores, East Northumberland County & Prince Edward County (Picton)","Affected_Service_llama":"Internet","Concern_llama":"Service Quality","carrier":"TelcoA","title":"Internet service quality issues for customers in Quinte Shores, East Northumberland County & Prince Edward County (Picton), Ontario","regional_title":"Internet service quality issues for customers in Quinte Shores, East Northumberland County & Prince Edward County (Picton), Ontario","count":11,"count_adj":28,"relative":"High","tweets":"[\"How about internet? My wifi hasn\\u2019t worked since the weekend\", \"@TelcoA @TelcoA_Support Scheduled a move on Oct 3 for Oct 28 to my new home in Quinte Shores. It's now Nov 8, still no internet. Tech visits - no progress. Latest update? May '24 install date. Unacceptable when I rely on it for work. #CustomerServiceFail\", \"@TelcoC @TelcoCHelps I\\u2019m so sick and tired of your companies bullshit. This is your last chance to have someone sent out to my place now and have my internet fixed or me and my family will be switching to @TelcoA @TelcoA_Support  24 hours.\", \"From what device are you testing? Because 1Gbps will max out a lot on network equipment.\", \"I switched it but it's still wanting me to verify.\"]","secone_data":"Over the past 6 hours in Quinte Shores, East Northumberland County & Prince Edward County, Ontario, call and video quality jitter scores have been above desired threshold (>30ms) 25% of the time.\n- Average Call Performance Jitter Score: 22ms\n- Average Video Performance Jitter Score: 25ms"},{"id":3,"Province":"Ontario","LongLat":"(-79.7284, 43.7794)","City":"Brampton North","Affected_Service_llama":"Internet","Concern_llama":"Service Outages","carrier":"TelcoA","title":"Internet service outages issues for customers in Brampton North, Ontario","regional_title":"Internet service outages issues for customers in Brampton North, Ontario","count":11,"count_adj":22,"relative":"Medium","tweets":"[\"@TelcoA_Support I keep receiving Error 2000 on my router and it won\\u2019t connect when I reset, what\\u2019s going on?\", \"Given that it\\u2019s been requested already by others, will it be added??\", \"It is not my account. It is a large number of postal codes, including many condos, in the Brampton area. And then it\\u2019ll say that the problem is resolved, but it\\u2019s not, and then 45 minutes later it will again say that Internet is down. This has been a daily occurrence for a week.\", \"I understand that the Getting Ontario Connected Act allows me to seek compensation for the downtime and costs associated with the unmarked, above ground cable and TelcoA\\u2019s response to the issue. Who should I make direct contact with in that regard?\", \"@TelcoA_Support This is what I have to walk into every day\\u2026your major line!!!! One day someone will get hurt!!! I\\u2019ve had a ticket opened and still nothing!!!\"]","secone_data":"Over the past 6 hours in Brampton North, Ontario, call and video quality jitter scores have been above desired threshold (>30ms) 2% of the time.\n- Average Call Performance Jitter Score: 11ms\n- Average Video Performance Jitter Score: 3ms"},{"id":4,"Province":"Quebec","LongLat":"(-72.0259, 46.8524)","City":"Capitale-Nationale (Stoneham)","Affected_Service_llama":"Internet","Concern_llama":"Service Outages","carrier":"TelcoA","title":"Internet service outages issues for customers in Capitale-Nationale (Stoneham), Quebec","regional_title":"Internet service outages issues for customers in Capitale-Nationale (Stoneham), Quebec","count":10,"count_adj":20,"relative":"Medium","tweets":"[\"It's still not working for me\\nVM is my provider\", \"@TelcoA_Support Just checking: I probably shouldn\\u2019t have to be resetting my modem multiple times a day in order to get my TV and internet to work, right?\", \"@TelcoA_Support ever since a planned upgrade last night from TelcoA, been getting 100mb speeds on a 1.5 gb connection. Self help tool did not help the issue\", \"When I was a customer the line wet dead every time it rained. You wouldn\\u2019t fix it but you kept getting paid. I changed services almost a decade ago & now you pricks want to dig up my yard.\"]","secone_data":"Over the past 6 hours in Capitale-Nationale (Stoneham), Quebec, call and video quality jitter scores have been above desired threshold (>30ms) 0% of the time.\n- Average Call Performance Jitter Score: 4ms\n- Average Video Performance Jitter Score: 5ms"},{"id":5,"Province":"Ontario","LongLat":"(-79.514, 43.857)","City":"Maple","Affected_Service_llama":"Internet","Concern_llama":"Service Outages","carrier":"TelcoA","title":"Internet service outages issues for customers in Maple, Ontario","regional_title":"Internet service outages issues for customers in Maple, Ontario","count":10,"count_adj":20,"relative":"Medium","tweets":"[\"@TelcoA_Support I don\\u2019t have internet or TV service in Maple, Ontario. Support keeps asking me to log into my TelcoA but can\\u2019t as I have no service\", \"@TelcoA_Support I work from home and pay a hefty bill for reliable internet. So far today I've had 2 random reboots. I have wifi pods and the system is NOT resilient. Each reboot results in a lengthy optimization period. This needs to be improved!\", \"There website still says not outtages. I must admit it is odd that they only use social media to forward information\", \"@TelcoA_Support wondering why there is such a problem with the internet. internet cuts out, we wait it comes back on only to have it cut out again 20 minutes later. Been off and on all night, For what we are charged a month, you think the service would be much better.\"]","secone_data":"Over the past 6 hours in Maple, Ontario, call and video quality jitter scores have been above desired threshold (>30ms) 54% of the time.\n- Average Call Performance Jitter Score: 40ms\n- Average Video Performance Jitter Score: 34ms"},{"id":6,"Province":"Quebec","LongLat":"(-73.256, 46.104)","City":"Lanaudière-Nord (Saint-Esprit)","Affected_Service_llama":"Internet","Concern_llama":"Service Outages","carrier":"TelcoA","title":"Internet service outages issues for customers in Lanaudière-Nord (Saint-Esprit), Quebec","regional_title":"Internet service outages issues for customers in Lanaudière-Nord (Saint-Esprit), Quebec","count":10,"count_adj":20,"relative":"Medium","tweets":"[\"just heard a specialist might reach out to me from 1800 number.  I am out of service at this moment\\ud83d\\ude02 so the agent asked my email. And it looks like the agent didn't hear any report for outage yet.  And the agent sent this to the department. hope they fix it soon\", \"Is it fixed now?\", \"@TelcoA_Support  I have been experiencing outages with my five internet for two days. First on Sunday and now today. I\\u2019ve done the usual plug\/unplug on my modem (homehub3000) and used the virtual repair tool to no avail.\", \"@TelcoA_Support is there an internet service outage in\/around Lanaudière-Nord area?\"]","secone_data":"Over the past 6 hours in Lanaudière-Nord (Saint-Esprit), Quebec, call and video quality jitter scores have been above desired threshold (>30ms) 11% of the time.\n- Average Call Performance Jitter Score: 13ms\n- Average Video Performance Jitter Score: 20ms"},{"id":7,"Province":"Ontario","LongLat":"(-79.6921, 43.4543)","City":"Oakville North","Affected_Service_llama":"Internet","Concern_llama":"Service Outages","carrier":"TelcoA","title":"Internet service outages issues for customers in Oakville North, Ontario","regional_title":"Internet service outages issues for customers in Oakville North, Ontario","count":10,"count_adj":10,"relative":"Low","tweets":"[\"@TelcoA_Support I'm in Oakville North ON and since the outage on Sunday we are not able to connect to wireless in our house. The hardwired connection works fine. Restarted the router multiple times and the wifi says no internet access?\", \"In a nice telecom jumble, I\\u2019m on hold adding another data top up ($70) w\/ @TelcoB for my mobile because @TelcoA_Support literally severed the coaxial cable to my \\ud83c\\udfe0 on Monday & @TelcoC ghosted the service appt, my provider @TekSavvyCSR has been great but still no internet and out $\", \"My internet has been out  since yesterday morning as well. What is the estimated time for repair.\", \"It\\u2019s not about troubleshooting. I received an email stating that cable got cut and it\\u2019s been over 7 hrs since being reported . Your status page showing still down...\"]","secone_data":"Over the past 6 hours in Oakville North, Ontario, call and video quality jitter scores have been above desired threshold (>30ms) 14% of the time.\n- Average Call Performance Jitter Score: 4ms\n- Average Video Performance Jitter Score: 15ms"},{"id":8,"Province":"Ontario","LongLat":"(-80.6586, 43.7722)","City":"Wellington (Elora)","Affected_Service_llama":"Internet","Concern_llama":"Service Quality","carrier":"TelcoA","title":"Internet service quality issues for customers in Wellington (Elora), Ontario","regional_title":"Internet service quality issues for customers in Wellington (Elora), Ontario","count":9,"count_adj":9,"relative":"Low","tweets":"[\"Morning @OVHcloud & @TelcoA_Support There seems to be intermittent connectivity issues between you two, at least with the Canadian data centre and our Toronto based FTTH services. Our TelcoA Ethernet series seem unaffected. Can you look into it?\", \"Any update when internet will start?\", \"7 because everyone is busy. But my job relies on access to the internet so fixing the problem sometime between 12-5 pm tomorrow isn\\u2019t really going to work.\", \"So not then? Because if you would claim that, and not provide full internet access (including IPv6) it would be fraud.\"]","secone_data":null},{"id":9,"Province":"British Columbia","LongLat":"(-122.7965, 49.2733)","City":"Port Coquitlam Central","Affected_Service_llama":"Internet","Concern_llama":"Service Quality","carrier":"TelcoA","title":"Internet service quality issues for customers in Port Coquitlam Central, British Columbia","regional_title":"Internet service quality issues for customers in Port Coquitlam Central, British Columbia","count":9,"count_adj":9,"relative":"Low","tweets":"[\"Port Coquitlam no internet. What's going on?\", \"Sorry, you are still without service. Please send us a DM with your account details. We will try to have this rectified as soon as possible. -KF\", \"@TelcoA_Support internet out, told a major outage? Any updates?\", \"@TelcoA_Support any word on fixing the Internet outage in Port Coquitlam?\"]","secone_data":null},{"id":10,"Province":"Ontario","LongLat":"(-79.7239, 43.5892)","City":"Mississauga (Lisgar \/ Meadowvale)","Affected_Service_llama":"Internet","Concern_llama":"Service Quality","carrier":"TelcoA","title":"Internet service quality issues for customers in Mississauga (Lisgar \/ Meadowvale), Ontario","regional_title":"Internet service quality issues for customers in Mississauga (Lisgar \/ Meadowvale), Ontario","count":8,"count_adj":8,"relative":"Low","tweets":"[\"@TelcoA_Support Is there an Internet outage in downtown Meadowvale?\", \"@TelcoA_Support is there an outage on Mississauga?\", \"Again!?! This can\\u2019t keep happening \\ud83d\\ude21\", \"I am telling you right now 14 hours without internet. We are losing $$$ here and we need to work\"]","secone_data":"Over the past 6 hours in Mississauga (Lisgar \/ Meadowvale), Ontario, call and video quality jitter scores have been above desired threshold (>30ms) 54% of the time.\n- Average Call Performance Jitter Score: 40ms\n- Average Video Performance Jitter Score: 34ms"},{"id":11,"Province":"Ontario","LongLat":"(-77.9302, 44.8324)","City":"Peterborough County and North Hastings County (Lakefield)","Affected_Service_llama":"Internet","Concern_llama":"Service Outages","carrier":"TelcoA","title":"Internet service outages issues for customers in Peterborough County and North Hastings County (Lakefield), Ontario","regional_title":"Internet service outages issues for customers in Peterborough County and North Hastings County (Lakefield), Ontario","count":8,"count_adj":8,"relative":"Low","tweets":"[\"It\\u2019s area wide . Affecting Peterborough County\", \"Same situation for me\", \"@TelcoA_Support hey guys their was a line cut in North Hastings County noon yesterday.  Having to use my phone for data, can we get a break on the charge and throttling?\", \"3rd time since August 8. FIX the problem.\"]","secone_data":"Over the past 6 hours in Peterborough County and North Hastings County (Lakefield), Ontario, call and video quality jitter scores have been above desired threshold (>30ms) 11% of the time.\n- Average Call Performance Jitter Score: 13ms\n- Average Video Performance Jitter Score: 20ms"},{"id":12,"Province":"Ontario","LongLat":"(-79.8773, 43.5034)","City":"Milton","Affected_Service_llama":"Internet","Concern_llama":"Service Quality","carrier":"TelcoA","title":"Internet service quality issues for customers in Milton, Ontario","regional_title":"Internet service quality issues for customers in Milton, Ontario","count":8,"count_adj":8,"relative":"Low","tweets":"[\"no way im not getting a technician until friday and i work from home. pathetic.\", \"Service appears to be restored\", \"@TelcoA_Support it's 15 hours since we got an update and over 6 hours past your estimated \\\"time of resolution\\\". Why is my internet still not back and why has there been no update?\", \"@TelcoA_Support \\n\\nSo far 26 hours without internet access in Milton. First world problems, but this is unacceptable.\"]","secone_data":"Over the past 6 hours in Milton, Ontario, call and video quality jitter scores have been above desired threshold (>30ms) 14% of the time.\n- Average Call Performance Jitter Score: 4ms\n- Average Video Performance Jitter Score: 15ms"},{"id":13,"Province":"British Columbia","LongLat":"(-122.8141, 49.1011)","City":"Surrey East","Affected_Service_llama":"Internet","Concern_llama":"Service Outages","carrier":"TelcoA","title":"Internet service outages issues for customers in Surrey East, British Columbia","regional_title":"Internet service outages issues for customers in Surrey East, British Columbia","count":7,"count_adj":7,"relative":"Low","tweets":"[\"The plan was to restart the modem but it seems to be a setting on the modem itself, as if its throttling anything other than the TV receivers. \\n\\nOut of multiple devices I've connected and tried with only 1 had a decent speed (300-400Mbps down), while all others were 10-12.\", \"@TelcoA_Support no internet and can\\u2019t use data to look at the hub.\", \"Worst part - coz of the temporary connection TelcoA has given us, like how third world country or development nations struggle with electricity coz of rain. We struggle with internet. Come what may - rain wind bird shitting on the wire, TelcoA internet goes away\"]","secone_data":null},{"id":14,"Province":"Quebec","LongLat":"(-74.7687, 46.2634)","City":"Laurentides-Nord (Montcalm)","Affected_Service_llama":"Internet","Concern_llama":"Service Quality","carrier":"TelcoA","title":"Internet service quality issues for customers in Laurentides-Nord (Montcalm), Quebec","regional_title":"Internet service quality issues for customers in Laurentides-Nord (Montcalm), Quebec","count":7,"count_adj":7,"relative":"Low","tweets":"[\"@TelcoA_Support \\nI have experienced the worst service from TelcoA internet at my home it has shutdown twice this month and remains till 2 days which affected my work from home job. Suggest never use TelcoA services at home @TelcoA @TelcoA_Support\", \"So you are not providing internet service, is that correct?\", \"Any reason? I\\u2019m having the same issue\\u2026\"]","secone_data":null},{"id":15,"Province":"Prince Edward Island","LongLat":"(-62.6487, 46.1668)","City":"Montague","Affected_Service_llama":"Internet","Concern_llama":"Service Outages","carrier":"TelcoA","title":"Internet service outages issues for customers in Montague, Prince Edward Island","regional_title":"Internet service outages issues for customers in Montague, Prince Edward Island","count":7,"count_adj":7,"relative":"Low","tweets":"[\"This is the fifth time in 2 months. i want a refund for all these days i haven\\u2019t had service\", \"@TelcoA_Support @TelcoA Internet out five days because a tech unplugged something. Bravo. \\ud83d\\udc4f Thanks for making us jump through hoops.\", \"Any reasonable estimates yet for service restoration? Service has been out for 9 hours+ so far.\"]","secone_data":null},{"id":16,"Province":"British Columbia","LongLat":"(-122.7677, 49.1636)","City":"Surrey Northeast","Affected_Service_llama":"Internet","Concern_llama":"Service Quality","carrier":"TelcoA","title":"Internet service quality issues for customers in Surrey Northeast, British Columbia","regional_title":"Internet service quality issues for customers in Surrey Northeast, British Columbia","count":7,"count_adj":7,"relative":"Low","tweets":"[\"I am in Surrey Northeast.  There was a reported outage in Surry that began at 5:27am on November 17th. The TelcoA website states this outage was fixed by 9:20am. However,  my home has been without internet & TV service for the last 35 hours. I am looking for help.\", \"what about Surrey Northeast out 2 days now!\", \"@TelcoA_Support  we are facing issue with internet outage from yesterday 5pm and u guys said it will be resolved by 11:11 am todaybut now saying 3:11 .. horrible !! Lists day for cable cut \\u2026 is it gonna come on 3 pm ???\"]","secone_data":null},{"id":17,"Province":"British Columbia","LongLat":"(-126.9517, 50.5899)","City":"North Island, Sunshine Coast, and Southern Gulf Islands (Whistler)","Affected_Service_llama":"Internet","Concern_llama":"Service Quality","carrier":"TelcoA","title":"Internet service quality issues for customers in North Island, Sunshine Coast, and Southern Gulf Islands (Whistler), British Columbia","regional_title":"Internet service quality issues for customers in North Island, Sunshine Coast, and Southern Gulf Islands (Whistler), British Columbia","count":7,"count_adj":7,"relative":"Low","tweets":"[\"@TelcoA_Support has there been issues with the network in Whistler lately??? Both my phone and my Wireless Home Internet have been struggling like crazy lately. Becoming almost unacceptable.\", \"@TelcoA_Support so my internet has been disconnected twice by your own incompetent service workers. Call in to get it reconnected, was told I need a new modem, got that, turns out it didn\\u2019t fix the problem. You sent a service work out, he couldn\\u2019t fix it either. Called his friend\", \"A tech should show up with a modem immediately. This whole business of, \\\"we're sending you one tomorrow, oh, actually the next day\\\" is ridiculous.\\n\\nYou can call the contact on file if you really want to make it right.\"]","secone_data":null},{"id":18,"Province":"Alberta","LongLat":"(-113.6377, 53.6199)","City":"St. Albert","Affected_Service_llama":"Internet","Concern_llama":"Service Quality","carrier":"TelcoA","title":"Internet service quality issues for customers in St. Albert, Alberta","regional_title":"Internet service quality issues for customers in St. Albert, Alberta","count":7,"count_adj":7,"relative":"Low","tweets":"[\"Already did that, doesnt work\", \"@TelcoA_Support still looking for why service hasn\\u2019t been restored in St. Albert! Absolutely a joke that I have both internet and wireless service and I can\\u2019t use both in my basement apartment ! \\ud83d\\ude02 \\ud83d\\ude02 \\ud83d\\ude02 #Robbed #5GDontwork\", \"Nope I will not be DMing anymore. This has been a colossal failure. 3 weeks no phone, 4 no show appointments, and now an internet service we never ordered. We\\u2019ve cancelled services\"]","secone_data":null}]