[{"Province": "Quebec", "LongLat": "(-73.256, 46.104)", "City": "Lanaudière-Nord (Saint-Esprit)", "Affected_Service_llama": "Internet", "Concern_llama": "Service Outage", "carrier": "TelcoC", "title": "Internet service outage issues  for TelcoC customers in Lanaudière-Nord (Saint-Esprit)", "regional_title": "Internet service outage issues  for TelcoC customers in Lanaudière-Nord (Saint-Esprit)", "count": 18, "count_adj": 54, "relative": "High", "tweets": "[\"I already had a chat with support yesterday. They\\u2019re sending a new modem but it\\u2019s going to take a while because of the holidays. It\\u2019s ridiculous this even has to happen. We\\u2019re stuck with no internet for Christmas break. I better get compensated for service not rendered this month\", \"@TelcoCHelps No internet since morning\", \"If you look at the outage map it\\u2019s getting larger not smaller\", \"No service in Lanaudière-Nord right now\", \"Wtf @TelcoC \\n5 straight days of no wifi in Lanaudière-Nord?! This is beyond ridiculous and pathetic.\\n\\n#Lanaudière-Nord #Saint-Esprit #quebec #Internet #TelcoC #TelcoA #TelcoB @TelcoCHelps\", \"What about Saint-Esprit area? Speeds below 1mbps since yesterday? This outage you lost is not the only problem. Colleagues with TelcoC and partners in Saint-Esprit are also nearly offline.\"]", "id": 1}, {"Province": "Ontario", "LongLat": "(-79.8773, 43.5034)", "City": "Milton", "Affected_Service_llama": "Internet", "Concern_llama": "Service Quality", "carrier": "TelcoC", "title": "Internet service quality issues  for TelcoC customers in Milton", "regional_title": "Internet service quality issues  for TelcoC customers in Milton", "count": 14, "count_adj": 42, "relative": "High", "tweets": "[\"I work from home and every single day your internet craps out!  Will TelcoC be paying for my lose of wages? You are right it is no fun!  How are you even legally allowed to charge for a services that works 5 days out of the month? \\n#ScamAlert\", \"In non technical terms, internet sucks. Slow,lagging,  freezing and my TV stops and I get the connection error message.  And I have reset the modem a couple times\", \"Anyone know ISP's that arent terrible and won't fuck me over when I game? Because TelcoC internet is awful.\", \"i don\\u2019t  think it\\u2019s popularity, I think you have a lot of disgruntled customers because of the service you offer.\", \"@TelcoCHelps appreciate getting internet service back. I know the technicians do a great job. TBH though, for the amount payed for service, the interruptions are too frequent and WiFi bottlenecks unfair. Really need to look at service structure. Thanks.\", \"The link at the top of the @TelcoCHelps page tells me there\\u2019s no issues!! Hahaha\", \"Hey @TelcoChelps your internet service is absolute garbage! Thanks for killing my survivor episode.\", \"@TelcoCHelps Are there any known issues in the L5B area? My modem just went from working to flashing amber in the last 15 minutes.\", \"Well even an update of were still working on it is better then silence or worse yet from TelcoC \\\"it's resolved\\\" \\n\\nSorry to hear about the router, that sucks\", \"Sorry -- if I am experiencing an issue at home, my next move is to check if others are as well, or if it is related to infra in my home. This is all we have, it's the bare minimum, and as mentioned it's in lieu of TelcoC' ability to communicate.\", \"That link to outages don\\u2019t even have anything about an outage today.  It has the one from yesterday and that\\u2019s it.  How can we check for updates when it\\u2019s not listed.\"]", "id": 2}, {"Province": "Ontario", "LongLat": "(-79.6901, 44.3891)", "City": "Barrie South", "Affected_Service_llama": "Internet", "Concern_llama": "Service Quality", "carrier": "TelcoC", "title": "Internet service quality issues  for TelcoC customers in Barrie South", "regional_title": "Internet service quality issues  for TelcoC customers in Barrie South", "count": 13, "count_adj": 11, "relative": "High", "tweets": "[\"Guess there's no hockey game or anything for me tonight.  Really tired of all the issues lately with TelcoC! Rebooted numerous times. Unplugged. Replugged. This and that.  Happens every 30-60 seconds!!! \\n@TelcoCHelps\", \"@TelcoC @TelcoCHelps showed face to get the check and left. Left serious safety hazard in worse condition than before. I almost choked to death walking behind my garage in the dark because I thought the 2 year old #safety issue was addressed.\", \"@TelcoC @TelcoCHelps IS A JOKE OF A COMPANY. At my house today to fix downed wires and it\\u2019s worse. It\\u2019s laughable. Your #safety and #negligence unheard of. More cables on ground than before. @CTVNews @PatForanCTVNews @TelcoA @BlueJays @Sportsnet\", \"Why you disrespecting the @Raptors by putting it on your secondary channel @TelcoC @TelcoCHelps\", \"I\\u2019m done with TelcoC. Switching to TelcoA in the AM.\", \"Of course you have fallen apart @TelcoCHelps multiple international crises tonight and y\\u2019all fail. \\n\\nThis FYI @FP_Champagne is why we told you not to allow the TelcoC Shaw merger. \\n\\nThey can\\u2019t competently manage their network as is. Now they are debt ridden and even worse\", \"@TelcoCHelps I keep getting this message over and over again even though I have the number blocked\"]", "id": 3}, {"Province": "British Columbia", "LongLat": "(-119.1638, 50.9647)", "City": "Central Okanagan and High Country (Revelstoke)", "Affected_Service_llama": "Internet", "Concern_llama": "Service Quality", "carrier": "TelcoB", "title": "Internet service quality issues  for TelcoB customers in Central Okanagan and High Country (Revelstoke)", "regional_title": "Internet service quality issues  for TelcoB customers in Central Okanagan and High Country (Revelstoke)", "count": 13, "count_adj": 34, "relative": "Medium", "tweets": "[\"I cannot get over how terrible the @TelcoB service is in Kelowna. \\nI\\u2019m in a city and have two bars, and nothing is working on my phone. \\n\\nThis sucks. @TelcoBsupport\", \"@CraveCanada why can\\u2019t we watch this on TelcoB? Doesn\\u2019t make sense.\", \"This option is not coming up on the TelcoB app\", \"I guess I\\u2019m watching NFL instead of the @EdmontonOilers due to regional restrictions. @TelcoB trying to force me to move home to Saskatchewan so I can watch the game? Why do I pay for all these @Sportsnet channels if I can\\u2019t watch the game!?\", \"That's the complaint fix it.\\nNever had this problem with TelcoA.\\nGuess be soon to switch back I think as TelcoB services going downhill and price going up.\"]", "id": 4}, {"Province": "Ontario", "LongLat": "(-79.4278, 43.7964)", "City": "Thornhill West", "Affected_Service_llama": "Internet", "Concern_llama": "Service Quality", "carrier": "TelcoB", "title": "Internet service quality issues  for TelcoB customers in Thornhill West", "regional_title": "Internet service quality issues  for TelcoB customers in Thornhill West", "count": 13, "count_adj": 32, "relative": "Medium", "tweets": "[\"Anyone get terrible data signal?\\nI don't know what the deal is, but despite all the main places I visit having good coverage, I often get horrible data speeds despite having full bars and paying for the faster speeds. I got the 75gb plan and its a total waste.  #TelcoB #5G #koodo\", \"That poor rep was not ready to hear it when I told him I'm not interested in TelcoB offering streaming services from perverted companies like Netflix or Disney+.\\n\\nLMAO.\\n\\nI was really polite about it though. But I heard his eyes popping through the phone! \\ud83d\\ude02\\ud83d\\ude02\\ud83e\\udd23\", \"Hosting these far right extremists like Tucker Carlson and Ben Shapiro at TelcoB Centre. confirms your support for Canada Ottawa occupation/border blockades & US January 6 insurrection and downfall of our democracies.\\nShould customers switch to TelcoB?\\n\\ncbc.ca/news/canada/calgary/s\\u2026\", \"Oh @TelcoB how do I dislike you lately. Recorded the @EdmontonOilers game and even the recording freezes and won\\u2019t go past 22 mins. \\ud83d\\ude21\\ud83e\\udd2c\\ud83d\\ude21\\ud83e\\udd2c\\ud83d\\ude21\"]", "id": 5}, {"Province": "Ontario", "LongLat": "(-81.6437, 42.8188)", "City": "Elgin (Dorchester)", "Affected_Service_llama": "TelcoB", "Concern_llama": "Customer Support", "carrier": "TelcoB", "title": "Customer support issues  for TelcoB customers in Elgin (Dorchester)", "regional_title": "Customer support issues  for TelcoB customers in Elgin (Dorchester)", "count": 12, "count_adj": 30, "relative": "Medium", "tweets": "[\"@TelcoB when did your #CustomerService become so sh*tty?! Why does no one value customers anymore? Do better, #TelcoB - seriously, do much, much better! #CustomerExperience\", \"@TelcoB and @TelcoBsupport must have a new slogan: Oops, our bad, but we're not sorry.\", \"@TelcoBsupport Well... been trying since Nov 29th to transfer my 2 personal lines to a new SMB offer but has resulted in days worth of hold time and being transferered around different deparments within TelcoB for weeks all saying \\\"it's another team that has to finish the request\\\"\", \"@TelcoB @TelcoBsupport you disappointed me beyond words. Will you ever resolve an issue?\", \"been on hold with @TelcoB for 24 minutes.... im not impressed.\", \"@TelcoB @TelcoBsupport 6) this support person sees my appointment; he calls commitment team. Find out they don\\u2019t see my appointment (??). He will make a new appointment but needs to cancel my current appointment but needs to submit a ticket to the back office first. Must wait 24hrs\"]", "id": 6}, {"Province": "Alberta", "LongLat": "(-113.6377, 53.6199)", "City": "St. Albert", "Affected_Service_llama": "Internet", "Concern_llama": "Service Quality", "carrier": "TelcoC", "title": "Internet service quality issues  for TelcoC customers in St. Albert", "regional_title": "Internet service quality issues  for TelcoC customers in St. Albert", "count": 11, "count_adj": 10, "relative": "Low", "tweets": "[\"Yep. Been going on for ages. I\\u2019ve had a ticket open with them for weeks about it. They validate that it\\u2019s widespread, it happens at 3:10am (sometimes every night for days). I\\u2019m calling again now. Drives me crazy\", \"Just letting you know. There is nothing you can do they\\u2019ve tried since they installed this garbage November 2020 nothing but huge interruptions can\\u2019t work embarrassing but other Roger customers know\", \"this applies to like 2 people. how about you fix internet in canada.\", \"@TelcoCHelps I haven\\u2019t even been with TelcoC for 3 weeks and my internet is already down \\ud83d\\ude44 should have stayed with TelcoA\", \"Rough\"]", "id": 7}, {"Province": "British Columbia", "LongLat": "(-123.1469, 49.1483)", "City": "Richmond Central", "Affected_Service_llama": "Internet", "Concern_llama": "Service Outage", "carrier": "TelcoC", "title": "Internet service outage issues  for TelcoC customers in Richmond Central", "regional_title": "Internet service outage issues  for TelcoC customers in Richmond Central", "count": 11, "count_adj": 10, "relative": "Low", "tweets": "[\"@TelcoCHelps is internet still down in Richmond?\", \"Down in Richmond too\", \"Yup here's the outage area\", \"You guys are having a major outage thats affecting a good portion of Richhmond Central, BC- why are you sending private DMs to people instead of communicating with everyone?\", \"@TelcoC @TelcoCHelps Internet has been out for the last 20 hours! (Since 1pm Monday)! When will this be resolved!? No updates on your sites since yesterday! For the prices you\\u2019re charging, this is unacceptable!\"]", "id": 8}, {"Province": "Alberta", "LongLat": "(-113.6339, 53.5157)", "City": "Edmonton West (West Jasper Place / West Edmonton Mall)", "Affected_Service_llama": "Internet", "Concern_llama": "Service Outage", "carrier": "TelcoC", "title": "Internet service outage issues  for TelcoC customers in Edmonton West (West Jasper Place / West Edmonton Mall)", "regional_title": "Internet service outage issues  for TelcoC customers in Edmonton West (West Jasper Place / West Edmonton Mall)", "count": 11, "count_adj": 10, "relative": "Low", "tweets": "[\"Anna says there's an outage in my area, again. This is the second time in less than a week. You'd think a multi billion corporation could figure how to keep the internet working for longer than five days at a time.\", \"@TelcoCHelps Internet dropping again in Edmonton. What's going on TelcoC? Outage again?\", \"@TelcoCHelps Internet is also down in West Edmonton. When do you expect it to come back up?\", \"What is this now\\u2026 weekly? If it\\u2019s not horrid drops to lowest speeds imaginable it\\u2019s just outages.\", \"@TelcoCHelps hey so it\\u2019s cool that you are working to fix this large area outage and this account is trying to give information. Might I suggest you make a pinned post about it with the link to the forum. Might save you some time/replies\"]", "id": 9}, {"Province": "Quebec", "LongLat": "(-74.034, 45.4042)", "City": "Vaudreuil- Dorion", "Affected_Service_llama": "Internet", "Concern_llama": "Service Outage", "carrier": "TelcoC", "title": "Internet service outage issues  for TelcoC customers in Vaudreuil- Dorion", "regional_title": "Internet service outage issues  for TelcoC customers in Vaudreuil- Dorion", "count": 11, "count_adj": 10, "relative": "Low", "tweets": "[\"Think we are back up now in Vaudreuil-Dorion\", \"you have a major internet interruption in Vaudreuil-Dorion\", \"@TelcoCHelps why have a service interruption/outage page if you are not going to update it when you have an outage?\", \"@TelcoCHelps \\nWhat's with the internet \\ud83d\\ude15  more than 1 hr now!!! Vaudreuil- Dorion area\\nEven phone internet is not working\", \"Read the page this helps posted and its saying fibre was cut like you kidding me a fibre cable cut and it brings down this much of an area then says could be over 8 to 12 hours to fix such a joke\"]", "id": 10}, {"Province": "British Columbia", "LongLat": "(-122.8691, 49.0992)", "City": "Surrey Upper West", "Affected_Service_llama": "Internet", "Concern_llama": "Service Quality", "carrier": "TelcoB", "title": "Internet service quality issues  for TelcoB customers in Surrey Upper West", "regional_title": "Internet service quality issues  for TelcoB customers in Surrey Upper West", "count": 11, "count_adj": 10, "relative": "Low", "tweets": "[\"Im celebrating TelcoB hasnt managed to send my job to manila yet. Or Guatemala. Or Romania. Or ElSalvador. Or Morocco. And on and on\", \"@TelcoBsupport hi I just switched over to TelcoB from virgin. my iPhone is not getting incoming calls? It won\\u2019t even ring and notify me when someone is trying to call me. Need some help please\", \"$450 billion globally projected for 2025. @TelcoB @TelcoBhealth and other telemedicine, mental \\\"health\\\" apps are a huge problem, as Pharma Marketing is right behind them, and the \\\"experts\\\" working for these virtual prescribing initiatives at $750/hour @agenceunik\", \"@TelcoB @TelcoBsupport @TelcoBCROOKS \\n\\nTelcoB unstable alarm SW calls the cops because the SW is defective. I guess you are not allowed to leave windows open during the summer.\\nDO NOT CONTRACT WITH TelcoB.\\n\\nI may take them to small claims court, just to be a pain in their ass!\"]", "id": 11}, {"Province": "Quebec", "LongLat": "(-73.2793, 45.7317)", "City": "Montérégie-Nord (Saint-Antoine- Sur-Richelieu)", "Affected_Service_llama": "Internet", "Concern_llama": "Pricing", "carrier": "TelcoB", "title": "Internet pricing issues  for TelcoB customers in Montérégie-Nord (Saint-Antoine- Sur-Richelieu)", "regional_title": "Internet pricing issues  for TelcoB customers in Montérégie-Nord (Saint-Antoine- Sur-Richelieu)", "count": 11, "count_adj": 11, "relative": "Low", "tweets": "[\"I\\u2019m with TelcoB too. I may do it online to save myself the $60 fee. I\\u2019m a cheap bitch. Lol\", \"@TelcoB @TelcoBsupport , letting me down with zero Black Friday deals that they can offer me but seeing @TelcoDMobile offer way better deals.. hmm should I make the switch? \\ud83e\\udd14\\ud83e\\udd14\\ud83e\\udd14\", \"LOL, just signed up with @TelcoB, getting 1TB 14 Pro for just $15/month for 2 years then return, and if I wanna keep it after that, it's $390!\\n\\nYay, the device I use like an iPodTouch gets an upgrade as I have 11 right now... what an upgrade! \\ud83e\\udd23\\ud83e\\udd23\\ud83e\\udd23\"]", "id": 12}, {"Province": "Quebec", "LongLat": "(-73.432, 46.0551)", "City": "Joliette", "Affected_Service_llama": "Internet", "Concern_llama": "Service Outage", "carrier": "TelcoC", "title": "Internet service outage issues  for TelcoC customers in Joliette", "regional_title": "Internet service outage issues  for TelcoC customers in Joliette", "count": 11, "count_adj": 10, "relative": "Low", "tweets": "[\"Same\", \"It\\u2019s still out for us as well! In Joliette! For hours now!\", \"The internet service is down for last more than an hour. I hope you guys are doing something.\", \"@TelcoCHelps Internet down, any ETA for it to be fixed? I confirmed it is not just me, via your website. Thanks!\", \"@TelcoCHelps @TelcoC No Internet in Joliette. Is there any outage or service disruption here?\", \"31 hours and still down. @TelcoCHelps @ReportTelcoC we have work to do. Is there any chance you can be honest about restoration of internet.\"]", "id": 13}, {"Province": "Quebec", "LongLat": "(-73.4329, 45.4841)", "City": "Saint-Hubert Central", "Affected_Service_llama": "TelcoC", "Concern_llama": "Customer Support", "carrier": "TelcoC", "title": "Customer support issues  for TelcoC customers in Saint-Hubert Central", "regional_title": "Customer support issues  for TelcoC customers in Saint-Hubert Central", "count": 11, "count_adj": 10, "relative": "Low", "tweets": "[\"Nope it has not been solved yet.!! It was over 1:07 mins. In the end i got case id for manager call back. I sent you a dm regarding that too. Let me know if you get chance to review the \\n interaction id\\u2019s and case id i provided. @TelcoC @TelcoCHelps #customerfeedback\", \"@TelcoCHelps are y'all really gonna have me on hold for 800 years just so I can cancel my service. I was trying to remain a customer but after 1.5 hours on hold I'm leaving!\", \"@TelcoC @TelcoCHelps Currently been on hold for over 90 minutes trying to speak to someone. How is it acceptable to charge me $2400 a year for this kind of service?\", \"I don't know why @TelcoC and @TelcoCHelps makes it so hard to stay loyal to them. I want to add new services  but I have been transferred TWICE to the wrong departments\", \"TelcoC has endless money for advertising (such as sponsoring concerts) but apparently none to negotiate a fair collective agreement with 300 unionized workers.   What else would you expect.\", \"Exactly. I\\u2019m so fn annoyed with TelcoC and AltimaTel\"]", "id": 14}, {"Province": "Quebec", "LongLat": "(-70.7456, 46.9055)", "City": "Appalaches (La Pocati√®re)", "Affected_Service_llama": "Internet", "Concern_llama": "Service Quality", "carrier": "TelcoC", "title": "Internet service quality issues  for TelcoC customers in Appalaches (La Pocati√®re)", "regional_title": "Internet service quality issues  for TelcoC customers in Appalaches (La Pocati√®re)", "count": 10, "count_adj": 10, "relative": "Low", "tweets": "[\"My internet unfortunately disconnected 4 times during stream and I had the stop \\ud83d\\ude2d.  I'm sorry for everyone who tuned in for games or entertainment and we're not able to enjoy it. @TelcoC @TelcoCHelps I need my internet to work properly ASAP\", \"@TelcoCHelps internet service ticket closed and internet is still down. Now on hold waiting for support team and its 1:45 hr wait !!!  You cant make this up!!!  So thats over 14 hours and counting trying to get my @TelcoC internet fixed again epic fail\", \"@TelcoCHelps y\\u2019all need to post what outage is happing. My internet is dog awful slow. Not impressed.\", \"@TelcoCHelps Hi can somebody take care of the cables that have been strewn across the sidewalk and taped to a tree. This is a safety hazard in my neighbourhood.\", \"This is fucking ridiculous. This is what happens when a monopoly takes over.\", \"Sadly that would require a major change in how internet infrastructure is set up. And honestly wire cuts a more indicative of what ever construction companies/crews are working in the area it happens in. They need to be more aware of where they are digging\"]", "id": 15}, {"Province": "Ontario", "LongLat": "(-79.7511, 43.7494)", "City": "Brampton Northwest", "Affected_Service_llama": "Internet", "Concern_llama": "Service Quality", "carrier": "TelcoC", "title": "Internet service quality issues  for TelcoC customers in Brampton Northwest", "regional_title": "Internet service quality issues  for TelcoC customers in Brampton Northwest", "count": 10, "count_adj": 10, "relative": "Low", "tweets": "[\"Every week the same story! Oh .. we are doing maintenance in your area, we are having connectivity issues , what is the point of calling if you aren\\u2019t fixing anything \\ud83e\\udd14\", \"Brampton Northwest.\", \"@TelcoC @TelcoCHelps \\nThe product says it supports 1.5GB.\\nI am paying for 500 Mbps.\\nAnd I am getting this. Care to explain please.\", \"I asked when I get a refund for having no service, since you didn\\u2019t answer me, I\\u2019ll ask again. When will I be getting a refund for the terrible service?\", \"@TelcoCHelps @TelcoC reporting no outages yet my internet has been in and out for hours. Ignite tv won\\u2019t load. Wifi in and out. Tried to chat- 176 people in The queue ahead of me.\", \"@TelcoC, you suck , @TelcoCHelps. You suck...way overpriced for useless service that does not work most of the time.\\n\\nWhere is the outage notification?\"]", "id": 16}, {"Province": "Ontario", "LongLat": "(-81.6986, 43.5651)", "City": "Middlesex (Clinton)", "Affected_Service_llama": "Internet", "Concern_llama": "Service Outage", "carrier": "TelcoC", "title": "Internet service outage issues  for TelcoC customers in Middlesex (Clinton)", "regional_title": "Internet service outage issues  for TelcoC customers in Middlesex (Clinton)", "count": 10, "count_adj": 39, "relative": "Low", "tweets": "[\"I already had a chat with support yesterday. They\\u2019re sending a new modem but it\\u2019s going to take a while because of the holidays. It\\u2019s ridiculous this even has to happen. We\\u2019re stuck with no internet for Christmas break. I better get compensated for service not rendered this month\", \"@TelcoCHelps No internet since morning L6S4C1\", \"If you look at the outage map it\\u2019s getting larger not smaller\", \"No service in Middlesex right now\", \"Wtf @TelcoC \\n5 straight days of no wifi in brampton?! This is beyond ridiculous and pathetic.\\n\\n#Middlesex #Internet #TelcoC #TelcoA #TelcoB @TelcoCHelps\", \"Speeds below 1mbps since yesterday? This outage you lost is not the only problem. Colleagues with TelcoC and partners in Middlesex are also nearly offline.\"]", "id": 17}, {"Province": "Ontario", "LongLat": "(-79.199, 43.0796)", "City": "Niagara Regional Municipality (Fonthill)", "Affected_Service_llama": "TelcoC", "Concern_llama": "Customer Support", "carrier": "TelcoC", "title": "Customer support issues  for TelcoC customers in Niagara Regional Municipality (Fonthill)", "regional_title": "Customer support issues  for TelcoC customers in Niagara Regional Municipality (Fonthill)", "count": 10, "count_adj": 10, "relative": "Low", "tweets": "[\"@TelcoCHelps hello. I did upgrade barely year ago to Pixel 6A. When did TelcoC have that available ?\", \"@IhateTelcoC @TelcoCHelps must be the worst company for customer service on the planet!!!!\", \"Help me @TelcoCHelps - see below. I need your help but no one in customer service is responding\\ud83d\\udc47\", \"TelcoC has garbage service and doesn\\u2019t care about it\\u2019s customers\", \"@TelcoCHelps I didn't update or change my pin!?\", \"@TelcoCHelps Hi, I sent a DM. Please take a look when you have a second. Thank you.\"]", "id": 18}, {"Province": "Quebec", "LongLat": "(-73.5284, 45.3973)", "City": "La Prairie", "Affected_Service_llama": "Internet", "Concern_llama": "Service Outage", "carrier": "TelcoC", "title": "Internet service outage issues  for TelcoC customers in La Prairie", "regional_title": "Internet service outage issues  for TelcoC customers in La Prairie", "count": 10, "count_adj": 10, "relative": "Low", "tweets": "[\".@startca what's with all the outages this week? Internet has been barely functioning. I'm blaming @TelcoCHelps because they refuse to upgrade the nodes.\", \"You post this 1m ago and the outage has been up and down for hours\", \"@TelcoCHelps no internet, tv, or home phone in GTA.  What's happening?\", \"@TelcoCHelps is there an outage in La Prairie? Internet has been intermittent all day and making working from home incredibly difficult\", \"No internet & TV services again ? \\ud83d\\ude21\"]", "id": 19}, {"Province": "Alberta", "LongLat": "(-117.2896, 56.6598)", "City": "Northwestern Alberta (High Level)", "Affected_Service_llama": "TelcoB", "Concern_llama": "Customer Support", "carrier": "TelcoB", "title": "Customer support issues  for TelcoB customers in Northwestern Alberta (High Level)", "regional_title": "Customer support issues  for TelcoB customers in Northwestern Alberta (High Level)", "count": 10, "count_adj": 10, "relative": "Low", "tweets": "[\"@TelcoB  @TelcoBsupport \\nTelcoB email me this offer for a new phone\\u2026..then refuse to give me this offer as they said they made a mistake\\u2026.wasting my time on a trip to the mall\\u2026.clearly they are not about \\u201cloyalty\\u201d and \\u201csupport\\u201d- false advertising and representation \\u2639\\ufe0f\\ud83d\\ude14\", \"after calling the TelcoB Line number 1-800-980-0030 over 60 times over 2 days, and 2 voicemails\\u2026.no. regular phone call, and finally got a phone call lined up with a tech?\", \"@TelcoB Please stop with the unsolicited sales calls...\", \"Hi @TelcoBsupport I\\u2019m very tired of TelcoB\\u2019 inability to properly support the things they sell. With @TelcoBHelps, things were easy and fast and they had longer hours for support. I mean, how hard is it to activate an LTE plan on a watch? Very hard, apparently. 10 hrs on hold hard.\", \"@TelcoBsupport How do I have my number removed from your sales call lists? It is at the point where I feel harassed. I had two sales calls yesterday. I have stated multiple times not to call me for sales calls. If this continues I will cancel my TelcoB existing TelcoB services.\"]", "id": 20}, {"Province": "Ontario", "LongLat": "(-80.6586, 43.7722)", "City": "Wellington (Elora)", "Affected_Service_llama": "TelcoB", "Concern_llama": "Customer Support", "carrier": "TelcoB", "title": "Customer support issues  for TelcoB customers in Wellington (Elora)", "regional_title": "Customer support issues  for TelcoB customers in Wellington (Elora)", "count": 10, "count_adj": 10, "relative": "Low", "tweets": "[\"@TelcoBsupport @TelcoB I would like what I\\u2019ve been offered to be honoured by TelcoB, but I am happy to go to another company that values me as a customer more than TelcoB if I need to\\u2026 4/4\", \"You guys hide comments on TelcoB neighborhood site. Got zero help all they did was hide the post.\", \"@TelcoB @TelcoBsupport - I bought an Obsidian #Pixel8Pro during Black Friday sale. I was told I could exchange the phone for a Blue one within 15 days. @BestBuyCanada found a replacement, but you guys did not exchange it coz you no longer had my plan. This is really unfair..!!\\ud83d\\ude2d\\ud83d\\ude21\", \"Hey @TelcoB @TelcoBsupport, I was warned, but I thought I would switch to you. It\\u2019s true, you have the absolute worst #CustomerService ever! I have been waiting for a callback for 4 hours! WTF? #Fail\", \"Just enroll in the Panorama program and take a long acting \\\"convenient\\\" depot antipsychotic injection ... call @TelcoB @TelcoBsupport if there are any issues they will connect you with an expert. @US_FDA @DeptVetAffairs\"]", "id": 21}, {"Province": "Ontario", "LongLat": "(-79.7602, 43.6858)", "City": "Brampton Southwest", "Affected_Service_llama": "TelcoC", "Concern_llama": "Customer Support", "carrier": "TelcoC", "title": "Customer support issues  for TelcoC customers in Brampton Southwest", "regional_title": "Customer support issues  for TelcoC customers in Brampton Southwest", "count": 10, "count_adj": 10, "relative": "Low", "tweets": "[\"@TelcoC  In addition to spending so much on marketing, do a bit of actual customer service, that may help to retain customers. \\nI did the mistake of porting to TelcoC few weeks ago and its been a nightmare. 3 stores visits and more than 3 hour long calls, still no service. OMG\", \"@TelcoCHelps \\n50 min. on phone \\u2026waiting. Auto call back won\\u2019t work for me today. Recording said a 22 min. wait time!! \\nAbsolutely RIDICULOUS!!\", \"@TelcoCHelps what\\u2019s up\", \"Hello @TelcoCHelps  do you surpress Calling Name Display in your outbound marketing calls to current subscribers? I received one of those this afternoon with the NNX of 403443 showing Three Hills, AB as the location and the supposed agent wasn't using a call script.\", \"@TelcoCHelps biggest customer service fail in Canada. TelcoC FAIL.\"]", "id": 22}, {"Province": "Quebec", "LongLat": "(-73.6389, 45.6061)", "City": "Montreal North", "Affected_Service_llama": "Internet", "Concern_llama": "Service Outage", "carrier": "TelcoC", "title": "Internet service outage issues  for TelcoC customers in Montreal North", "regional_title": "Internet service outage issues  for TelcoC customers in Montreal North", "count": 9, "count_adj": 9, "relative": "Low", "tweets": "[\"@TelcoC @TelcoChelps #downagain Really!!! FFS, 3 days in a row with total outages.  Ticket opened, closed as resolved, phone queue\\u2019s not tolerable to wait.  You are playing with people\\u2019s livelihood here.  I stayed away from Starlink for concerns of stability, but the risk is low!\", \"@TelcoCHelps Montreal North internet down!\", \"@TelcoCHelps @TelcoC when\\u2019s the bloody internet coming back!? It\\u2019s been 8 hrs and we have a lot to do, specially when we can\\u2019t use the mobile data because the TelcoC coverage is abysmal in our area! #TelcoC #fail\", \"Hello @TelcoCHelps are there any service interruptions outages in Vaughan now?\", \"Hey @TelcoCHelps  I\\u2019ve been trying to stream a movie for over an hour and there\\u2019s no service - what gives? Is there an outage here in Montreal North?\"]", "id": 23}, {"Province": "Saskatchewan", "LongLat": "(-109.2415, 54.2836)", "City": "Northwestern Saskatchewan (Battleford)", "Affected_Service_llama": "TelcoC", "Concern_llama": "Customer Support", "carrier": "TelcoC", "title": "Customer support issues  for TelcoC customers in Northwestern Saskatchewan (Battleford)", "regional_title": "Customer support issues  for TelcoC customers in Northwestern Saskatchewan (Battleford)", "count": 9, "count_adj": 9, "relative": "Low", "tweets": "[\"@TelcoC @TelcoCHelps been on hold for 75m now on a call the YOU asked me to make to you. Any chance someone will answer my call?\", \"@TelcoCHelps Please respond\", \"Been troubleshooting w TelcoC online for the past hour. Haven\\u2019t made any gains yet.\\n\\nWaiting on hold for someone to answer the line for over an hour as well. How many days does it take to set up a @TelcoC account? I\\u2019m on day-5 & definitely cancelling 1 of the 2 services.\", \"What a screw up TelcoC has been talking to them for the last two hours from customer service to tech support to the loyalty department no one knows what they are doing. \\n@TelcoCHelps @EdwardSTelcoC #TelcoC cancelled my appointment without knowledge.\", \"@TelcoC @TelcoCBiz @TelcoCHelps Your \\\"office of the President\\\" won't even reply to my emails regarding my complaint to the #BetterBusinessBureau, some \\\"customer service\\\" you people have. Absolutely astounding how scummy you people are to a customer that's been with you people 1/2\"]", "id": 24}]